app/Controllers/Barang.php

    public function index()
    {
        $data['barang'] = $this->barangModel
            ->select('barang.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
            ->findAll();
---
SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`

    public function edit($id)
    {
        $data['barang'] = $this->barangModel->find($id);
        $data['kategori'] = $this->kategoriModel->findAll();
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '4'
SELECT *
FROM `kategori`

    public function update($id)
    {
        $data = [
            'kode_barang' => $this->request->getPost('kode_barang'),
            'nama_barang' => $this->request->getPost('nama_barang'),
            'kategori_id' => $this->request->getPost('kategori_id'),
            'satuan' => $this->request->getPost('satuan'),
            'stok' => (int)$this->request->getPost('stok'),
        ];

        $this->barangModel->update($id, $data);
---
UPDATE `barang` SET `kode_barang` = 'BRG004', `nama_barang` = 'Laptop Acer', `kategori_id` = '6', `satuan` = 'unit', `stok` = 11
WHERE `barang`.`id` IN ('4')