app/Controllers/BarangMasuk.php

SELECT `barang_masuk`.`id`, `barang`.`nama_barang`, `barang_masuk`.`jumlah`, `barang_masuk`.`tanggal_masuk`, `barang`.`id` as `barang_id`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id` = `barang_masuk`.`barang_id`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('barang_masuk');
        $builder->select('barang_masuk.id, barang.nama_barang, barang_masuk.jumlah, barang_masuk.tanggal_masuk, barang.id as barang_id');
        $builder->join('barang', 'barang.id = barang_masuk.barang_id');
        $query = $builder->get();