app/Controllers/BarangKeluar.php

SELECT `barang_keluar`.`id`, `barang`.`nama_barang`, `barang_keluar`.`jumlah`, `barang_keluar`.`tanggal_keluar`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id` = `barang_keluar`.`barang_id`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('barang_keluar');
        $builder->select('barang_keluar.id, barang.nama_barang, barang_keluar.jumlah, barang_keluar.tanggal_keluar');
        $builder->join('barang', 'barang.id = barang_keluar.barang_id');
        $query = $builder->get();