app/Controllers/Home.php

SELECT *
FROM `barang`
SELECT `barang_masuk`.*, `barang`.`nama_barang`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id` = `barang_masuk`.`barang_id`
SELECT `barang_keluar`.*, `barang`.`nama_barang`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id` = `barang_keluar`.`barang_id`
---
    public function index()
    {
        $data['barang'] = $this->barangModel->findAll();

        // Barang Masuk dengan nama barang
        $builderMasuk = $this->barangMasukModel->builder();
        $builderMasuk->select('barang_masuk.*, barang.nama_barang');
        $builderMasuk->join('barang', 'barang.id = barang_masuk.barang_id');
        $data['barang_masuk'] = $builderMasuk->get()->getResultArray();

        // Barang Keluar dengan nama barang
        $builderKeluar = $this->barangKeluarModel->builder();
        $builderKeluar->select('barang_keluar.*, barang.nama_barang');
        $builderKeluar->join('barang', 'barang.id = barang_keluar.barang_id');
        $data['barang_keluar'] = $builderKeluar->get()->getResultArray();