app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data['kategori'] = $this->kategoriModel->findAll();

INSERT INTO `kategori` (`nama_kategori`) VALUES ('IT EQUIPMENTS')
---
    public function store()
    {
        $this->kategoriModel->save([
            'nama_kategori' => $this->request->getPost('nama_kategori')
        ]);

DELETE FROM `kategori`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $this->kategoriModel->delete($id);