app/Controllers/Pembelian.php

    public function index()
    {
        $data['pembelian'] = $this->pembelianModel->findAll();
---
SELECT *
FROM `pembelian`